In [2]:
import pandas as pd

In [3]:
#Answer 1:
a = pd.Series([4, 8, 15, 16, 23,42])
type(a)

pandas.core.series.Series

In [4]:
#Answer 2:
index = ["Name"]
data = ["Abhay","Aniket","Shobhit","Aditya","Abhishek","Atharv","Shivanshu","Sonu","Abhijeet","Shreya"]

b = pd.Series([data],index = index)
b

Name    [Abhay, Aniket, Shobhit, Aditya, Abhishek, Ath...
dtype: object

In [10]:
#Answer 3:
i = {"Name" : ["Alice","Bob","Claire"],"Age" : [20,30,27],"Gender" : ["Female","Male","Female"]}
df = pd.DataFrame(i)
df

     Name  Age  Gender
0   Alice   20  Female
1     Bob   30    Male
2  Claire   27  Female

In [12]:
"""Answer 4: 
Dataframe is a Two-dimensional table like structure which is used to store and access data.
A Series is a one dimensional structure which can store only one type of data.
A dataframe can be built using multiple series with a common index.
"""
a = ["Abhay","Aniket"]
b = [1,2]
a1 = pd.Series(a)
b1 = pd.Series(b)
c = {"Name":a1,"Roll No":b1}
d = pd.DataFrame(c)
d

     Name  Roll No
0   Abhay        1
1  Aniket        2

In [17]:
"""Answer 5: 
Some of the Common Function for manipulating data using Pandas are:
1. head()- Used for printing first 5 values of the dataframe
2. tail() - Used for printing last 5 values of the dataframe
3. type() - Used for printing the type of a variable
4. dtypes - Used for displaying the data type of the columns"""
i = {"Name" : ["Alice","Bob","Claire"],"Age" : [20,30,27],"Gender" : ["Female","Male","Female"]}
df = pd.DataFrame(i)
type(df),df.dtypes

(pandas.core.frame.DataFrame,
 Name      object
 Age        int64
 Gender    object
 dtype: object)

In [19]:
df.head(),df.tail

(     Name  Age  Gender
 0   Alice   20  Female
 1     Bob   30    Male
 2  Claire   27  Female,
 <bound method NDFrame.tail of      Name  Age  Gender
 0   Alice   20  Female
 1     Bob   30    Male
 2  Claire   27  Female>)

In [ ]:
"""Answer 6:
Series and Dataframes are mutable in nature and their values can be changed whereas
Pannel are immutable in nature
"""

In [20]:
#Answer 7:
a = ["Abhay","Aniket","Shobhit","Shivanshu","Abhijeet"]
b = [1,2,3,4,5]
a1 = pd.Series(a)
b1 = pd.Series(b)
c = {"Name":a1,"Roll No":b1}
d = pd.DataFrame(c)
d

        Name  Roll No
0      Abhay        1
1     Aniket        2
2    Shobhit        3
3  Shivanshu        4
4   Abhijeet        5